<?php

/*
 * 4.16. Дано целое число в диапазоне 100..999. Вывести
        строку — словесное описание данного числа,
        например: 256 — "двести пятьдесят шесть", 814 —
        "восемьсот четырнадцать".
*/

function foo($num) {
    $strHundreds = [
        0 => '',
        1 => 'сто',
        2 => 'двести',
        3 => 'триста',
        4 => 'четыреста',
        5 => 'пятьсот',
        6 => 'шестьсот',
        7 => 'семьсот',
        8 => 'восемьсот',
        9 => 'девятьсот'
    ];
    $strTens = [
        0 => '',
        1 => 'десять',
        2 => 'двадцать',
        3 => 'тридцать',
        4 => 'сорок',
        5 => 'пятьдесят',
        6 => 'шестьдесят',
        7 => 'семьдесят',
        8 => 'восемьдесят',
        9 => 'девяносто',
    ];
    $strOnes = [
        0 => '',
        1 => 'один',
        2 => 'два',
        3 => 'три',
        4 => 'четыре',
        5 => 'пять',
        6 => 'шесть',
        7 => 'семь',
        8 => 'восемь',
        9 => 'девять',
    ];

    $digits = str_split($num);
    $digits = array_map('intval', $digits);
    echo $strHundreds[$digits[0]] . " " . $strTens[$digits[1]] . " " . $strOnes[$digits[2]];
}

foo(642);