<?php

/*
 * 17.1. Дано упорядоченное дерево глубины N > 0, каждая
        внутренняя вершина которого имеет K (< 9)
        непосредственных потомков, которые нумеруются от 1
        до K. Корень дерева имеет номер 0. Записать в
        текстовый файл с именем Name все возможные пути,
        ведущие от корня к листьям (каждый путь
        записывается в отдельной строке файла). Перебирать
        пути, начиная с "самого левого" и заканчивая "самым
        правым", при этом первыми заменять конечные
        элементы пути.
*/
