<?php

/*
 * 3.6. Значения переменных X, Y, Z поменять местами так,
        чтобы они оказались упорядоченными по
        возрастанию.
*/

function foo($x, $y, $z) {
    if ($x > $y) {
        $tmp = $y;
        $y = $x;
        $x = $tmp;
        if ($x > $z) {
            $tmp = $z;
            $z = $x;
            $x = $tmp;
        }
    }
    if ($y > $z) {
        $tmp = $z;
        $z = $y;
        $y = $tmp;
    } else {

    }
    echo "\nX: " . $x . "\nY: " . $y . "\nZ: " . $z;
}

foo(6, 4, 2);
foo( 9, 1, 2);
foo(1, 4, 8);