<?php

/*
 * 9.2. Дана матрица размера 5x9. Найти суммы элементов
        всех ее четных столбцов.
*/

function foo($matrix) {
    $sum = 0;
    for ($i = 0; $i < count($matrix); $i++) {
        for($j = 0; $j < count($matrix[$i]); $j += 2) {
            $sum += $matrix[$i][$j];
        }
    }

    echo $sum . PHP_EOL;
}

foo([[1, 2, 3, 4, 5, 6, 7, 8, 9],
    [2, 3, 4, 5, 6, 7, 8, 9, 10],
    [3, 4, 5, 6, 7, 8, 9, 10, 11],
    [4, 5, 6, 7, 8, 9, 10, 11, 12],
    [5, 6, 7, 8, 9, 10, 11, 12, 13]]);