<?php

/*
 * 9.8. Дана целочисленная матрица размера MxN. Различные
        строки (столбцы) матрицы назовем похожими, если
        совпадают множества чисел, встречающихся в этих
        строках (столбцах). Найти количество строк, похожих
        на первую строку.
*/

function foo($matrix) {
    $count = 0;
    $sameRow = true;

    for ($i = 1; $i < count($matrix); $i++) {
        for ($j = 0; $j < count($matrix[$i]); $j++) {
            if ($matrix[0][$j] != $matrix[$i][$j]) {
                $sameRow = false;
            }
        }
        if ($sameRow) {
            $count++;
            $sameRow = true;
        } else {
            $sameRow = true;
        }
    }

    echo 'Количество рядов схожих с 1м: ' . $count . PHP_EOL;
}

foo([[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
    [3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
    [4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    [5, 6, 7, 8, 9, 10, 11, 12, 13, 14]]);